{"status":["ok"],"totalResults":[3],"articles":[{"source":{"id":{},"name":["Geeky Gadgets"]},"author":["Julian Horsey"],"title":["Best Resources and Courses For AI and Machine Learning In 2025"],"description":["Artificial Intelligence (AI) and Machine Learning (ML) might feel like buzzwords that are everywhere these days, but there’s a reason for that—they’re reshaping how we live, work, and solve problems. Whether you’re scrolling through personalized recommendatio…"],"url":["https://www.geeky-gadgets.com/ai-and-machine-learning-courses-2025/"],"urlToImage":["https://www.geeky-gadgets.com/wp-content/uploads/2024/11/ai-machine-learning-resources-2025.jpg"],"publishedAt":["2024-12-01T09:02:47Z"],"content":["Artificial Intelligence (AI) and Machine Learning (ML) might feel like buzzwords that are everywhere these days, but theres a reason for thattheyre reshaping how we live, work, and solve problems. Wh… [+6468 chars]"]},{"source":{"id":{},"name":["Mit.edu"]},"author":["Peter Dizikes | MIT News"],"title":["A data designer driven to collaborate with communities"],"description":["MIT Associate Professor Catherine D’Ignazio has a strong interest in applying data to social issues. She works to help communities gain access to data and provide a fuller picture of civic problems."],"url":["https://news.mit.edu/2024/data-designer-catherine-dignazio-collaborates-with-communities-1201"],"urlToImage":["https://news.mit.edu/sites/default/files/images/202411/MIT-Catherine_DIgnazio-01-press.jpg"],"publishedAt":["2024-12-01T05:00:00Z"],"content":["It is fairly common in public discourse for someone to announce, I brought data to this discussion, thus casting their own conclusions as empirical and rational. It is less common to ask: Where did t… [+6278 chars]"]},{"source":{"id":{},"name":["Newsmonkey.be"]},"author":["Redactie"],"title":["China’s jonge innovators laten AI vormgeven aan de toekomst"],"description":["In het kort Een Chinese 20-jarige maakte een belangrijke carrièrekeuze door af te zien van een gegarandeerde studie ondanks zijn perfecte GPA. Hij voelde zich aangetrokken tot de wereld van AI-startups, omdat hij geloofde dat artificiële intelligentie een rev…"],"url":["https://newsmonkey.be/china-innovators-toekomst-ai/"],"urlToImage":["https://media.newsmonkey.be/2024/11/GettyImages-1009716350.jpg"],"publishedAt":["2024-12-01T10:49:00Z"],"content":["In het kort\r\n<ul><li>Een Chinese 20-jarige begon in AI met een miniprogramma voor tijdregistratie genaamd “Sushiji” dat de aandacht trok van AI-investeringsfondsen.<\/li><li>Vandaag de dag leidt hij C… [+3152 chars]"]}]}
